In [1]:
import numpy as np
import pandas as pd

In [2]:
# data in dictionary
Product = {'Model': ['Tshirt','Pants','Jacket'],
'Price':np.array([10,15,20]),
'Quantity':[50,35,15],
}

In [3]:
print(Product)

{'Model': ['Tshirt', 'Pants', 'Jacket'], 'Price': array([10, 15, 20]), 'Quantity': [50, 35, 15]}

In [4]:
print(Product.keys())

dict_keys(['Model', 'Price', 'Quantity'])

In [5]:
print(Product.values())

dict_values([['Tshirt', 'Pants', 'Jacket'], array([10, 15, 20]), [50, 35, 15]])

In [6]:
df = pd.DataFrame(Product)

In [7]:
df

    Model  Price  Quantity
0  Tshirt     10        50
1   Pants     15        35
2  Jacket     20        15

In [8]:
type(df)

pandas.core.frame.DataFrame

subset observation

In [10]:
df['Model']

0    Tshirt
1     Pants
2    Jacket
Name: Model, dtype: object

In [11]:
df[['Quantity', 'Model']]

   Quantity   Model
0        50  Tshirt
1        35   Pants
2        15  Jacket

In [12]:
df = pd.DataFrame(Product, index =['Row0', 'Row1', 'Row2'])

In [13]:
df

       Model  Price  Quantity
Row0  Tshirt     10        50
Row1   Pants     15        35
Row2  Jacket     20        15

In [15]:
df.loc[['Row0','Row2'], ['Model', 'Quantity']]

       Model  Quantity
Row0  Tshirt        50
Row2  Jacket        15

In [17]:
df.iloc[:,[0,2]]

       Model  Quantity
Row0  Tshirt        50
Row1   Pants        35
Row2  Jacket        15

head and tail

In [18]:
df.head(2)

       Model  Price  Quantity
Row0  Tshirt     10        50
Row1   Pants     15        35

In [19]:
df.tail(1)

       Model  Price  Quantity
Row2  Jacket     20        15

data summary

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, Row0 to Row2
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Model     3 non-null      object
 1   Price     3 non-null      int32
 2   Quantity  3 non-null      int64
dtypes: int32(1), int64(1), object(1)
memory usage: 192.0+ bytes

In [21]:
df.describe()

       Price   Quantity
count    3.0   3.000000
mean    15.0  33.333333
std      5.0  17.559423
min     10.0  15.000000
25%     12.5  25.000000
50%     15.0  35.000000
75%     17.5  42.500000
max     20.0  50.000000

In [22]:
Product = {'Model': ['Tshirt','Tshirt','Pants','Jacket'],
'Price':np.array([10,12,15,20]),
'Quantity':[50,40,35,15],
}

In [23]:
df = pd.DataFrame(Product)

In [24]:
df

    Model  Price  Quantity
0  Tshirt     10        50
1  Tshirt     12        40
2   Pants     15        35
3  Jacket     20        15

In [25]:
df.sort_values('Model')

    Model  Price  Quantity
3  Jacket     20        15
2   Pants     15        35
0  Tshirt     10        50
1  Tshirt     12        40

In [26]:
df.sort_values('Price')

    Model  Price  Quantity
0  Tshirt     10        50
1  Tshirt     12        40
2   Pants     15        35
3  Jacket     20        15

In [27]:
df.sort_values('Quantity', ascending=False)

    Model  Price  Quantity
0  Tshirt     10        50
1  Tshirt     12        40
2   Pants     15        35
3  Jacket     20        15

logical operations

In [29]:
filter_tshirt = (df['Model'] == 'Tshirt')

In [30]:
df.loc[filter_tshirt]

    Model  Price  Quantity
0  Tshirt     10        50
1  Tshirt     12        40

In [31]:
df.loc[df['Model']=='Tshirt', :]

    Model  Price  Quantity
0  Tshirt     10        50
1  Tshirt     12        40

In [32]:
filter_price = (df['Price'] >= 15)

In [33]:
df2 = df.loc[filter_price, :]

In [34]:
df2

    Model  Price  Quantity
2   Pants     15        35
3  Jacket     20        15

In [36]:
df2.sort_values('Price')

    Model  Price  Quantity
2   Pants     15        35
3  Jacket     20        15